Apps/app/Controllers/Admin.php

    public function proccess()
    {
        $users = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $dataUser = $users->where([ 'email' => $email])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'user@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1